docs/example_automatic_conversion/foam_cases/base_01_inlet_3_bif_1.4_outlet_1.6_angle_0/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    WALL
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }


	INLET
	{
		type     surfaceNormalFixedValue;
		refValue -0.07458694962113137;
	}

    OUTLET_1
    {
        type            zeroGradient;
    }

    OUTLET_2
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //